[
    {
        "Movie": "Doctor",
        "Director": "Nelson Dilipkumar",
        "Realesed_on": "09th october 2021",
        "Overview": "An army doctor helps his love interest's family to find their kidnapped daughter.",
        "story": "In Nelson Dilipkumar's Kolamaavu Kokila, the protagonist took to crime to save her poor family. In this sophomore effort, he once again gives us a protagonist who takes up crime for a good cause. The first time we see this protagonist, Varun (Sivakarthikeyan), he is at the battle front treating an injured terrorist. A superior questions why he has chosen to save the terrorist over an Indian soldier, and he coolly retorts that the latter's injury is fatal, so saving the terrorist would help in intelligence gathering. He is unemotional that way.This is certainly a different role for Sivakarthikeyan, who, unlike in other films, is made to be less expressive and less talkative. In the initial scenes, seeing the actor this way does seem jarring. We wonder why he has to be absolutely expressionless and robotic, but as the story develops, you see how this very trait comes in handy for this character to do the things that he does. Discounting his attempt at portraying a serious character in Kanaa, one could call this his first serious hero role. In fact, only Sivakarthikeyan and Vinay, who charmingly plays the suave, ruthless villain Terry, who runs a kidnapping operation, get to play straight-faced characters among the film’s principal cast. Every other actor is funny in one way or the other.And Sivakarthikeyan sportingly lets the other actors — especially comedians — take the limelight. Among the bunch of comic performers, Redin Kingsly almost walks away with the film. His style is distinct among comedians who can deadpan. While most of them go subtle, he goes to the other extreme - loud and so over-the-top. Nelson seems to realise that this shtick could quickly become tiresome, and uses him effectively by pitting him against Yogi Babu, who is also in terrific form. Then, there is Deepa Shankar, who gets some of the film’s funniest lines, and is great with physical comedy. We also get a couple of bumbling criminals, Sunil Reddy and Shiva, who do a fab job in the second half of the film, when Varun and the family of Padmini (Priyankaa Mohan, likeable) embark on a mission to Goa to save Chinnu (Zaara Vineet), the school-going daughter of her elder brother (the late Arun Alexander) and sister-in-law Sumathi (Archana, who is quite effective).Interestingly, Padmini is Varun's fiancé (ex-fiancé, as he corrects another character later in the film). The scene in which she rejects him in the presence of both their families sets the tone for the rest of the film. Nelson doesn't let go of this darkly humorous tone even when things get serious (they have to, given the nature of the crime the film deals with). The humour quotient does dip in the second half, but Nelson manages to inject a funny quip or two to keep the tone from getting too serious. Take the scene towards the climax when a character decides to apologise to everyone they have put in harm's way. The director gives it an entirely wacky touch that even as you laugh, there is something emotionally affecting about it. Even the one action set-piece in the film is peppered with comedy and inventiveness in staging. And Anirudh's lively background score, especially in the climax, elevates a moment that is tonally different (let's say, it is more 'heroic') from the rest of the film.And all along, the writing remains solid, giving us situations that might have felt implausible in a serious film, but work brilliantly because of the black comedy.”.\n\n",
        "Rating": "out of 5 stars 4"
    },
    {
        "Movie": "Calls",
        "Director": "J. Sabarish",
        "Realesed_on": "Feb 26, 2021",
        "Overview": "The movie turns out to be a hotchpotch of weak characters and unproductive sub-plots.",
        "story": "Calls is a classic example of how too many ineffective characters, interwoven with myriads of episodes, could test the patience of audience. Nandini (VJ Chitra), who works at a BPO in Chennai, struggles to meet her target and she is on the verge of losing her job. She attempts to convince customers from different walks of life to renew their internet plan, but in vain. What should have ideally been a sequence becomes far-stretched by including several sub-plots with pointless characters which hardly help the story which is supposed to be a regular family drama, involving a father, mother and daughter.The story also has elements like child abuse, medical crime, women safety, and so on. There is also a revenge angle, apart from a few attempts to create comedy. Sadly, none of these works, except for the child abuse segment which makes us empathise with the victim. The rushed twists and turns towards the end, too, turn futile. Despite an earnest performance from Chitra and Sriranjini, the movie turns out to be a hotchpotch of weak characters and unproductive sub-plots..\n\n",
        "Rating": "out of 5 stars 3."
    }
]























































